import React from 'react';
import './HomePage.sass'
import mainBackground_1 from '../../IMG/LandIMG/main_background_1.png'
import {Link} from "react-router-dom"
import "slick-carousel/slick/slick.css"
import "slick-carousel/slick/slick-theme.css"
import Slider from "react-slick"

const HomePage = () => {
    const exampleItemData = [
        {
            "image" : "вишневе компоте шокол мус.jpg",
            "name" : "Вишневе компоте шокол мус",
            "description" : "Опис"
        },
        {
            "image" : "лавандові спогади.jpg",
            "name" : "Лавандові спогади",
            "description" : "Опис"
        },
        {
            "image" : "екзотична маракуя.jpg",
            "name" : "Екзотична маракуя",
            "description" : "Опис"
        },
        {
            "image" : "зефір.jpg",
            "name" : "Зефір",
            "description" : "Опис"
        },
        {
            "image" : "королівськи фундук.jpg",
            "name" : "Королівський фундук",
            "description" : "Опис"
        },
        {
            "image" : "горіхови мікс.jpg",
            "name" : "Горіховий мікс",
            "description" : "Опис"
        },
        {
            "image" : "загадкови абрикос.jpg",
            "name" : "Загадковий абрикос",
            "description" : "Опис"
        },
        {
            "image" : "крем брюле.jpg",
            "name" : "Крем брюле",
            "description" : "Опис"
        },
        {
            "image" : "літні романс.jpg",
            "name" : "Літній романс",
            "description" : "Опис"
        },
        {
            "image" : "лімончелло.jpg",
            "name" : "Лімончелло",
            "description" : "Опис"
        }
    ]
    let settings = {
        dots: false,
        infinite: true,
        speed: 500,
        slidesToShow: 1,
        arrows: false,
        autoplay: true,
        autoplaySpeed: 3000,
        slidesToScroll: 1
    };
    return (
        <div className={'HomePage'}>
            <Slider {...settings}>
                <div className='topSlide'>
                    <div className="mainText">
                        <p>
                            КОЛИ ЙДЕТЬСЯ МОВА ПРО СОЛОДКЕ ОПІР ЧИНИТИ МАРНО
                        </p>
                    </div>
                    <img src={require('../../IMG/LandIMG/main_background_1.png')}
                         alt="КОЛИ ЙДЕТЬСЯ МОВА ПРО СОЛОДКЕ ОПІР ЧИНИТИ МАРНО"/>
                </div>
                <div className='topSlide'>
                    <div className="mainText">
                        <p>
                            КОЛИ ЙДЕТЬСЯ МОВА ПРО СОЛОДКЕ ОПІР ЧИНИТИ МАРНО
                        </p>
                    </div>
                    <img src={require('../../IMG/LandIMG/main_background_2.png')}
                         alt="КОЛИ ЙДЕТЬСЯ МОВА ПРО СОЛОДКЕ ОПІР ЧИНИТИ МАРНО"/>
                </div>
                <div className='topSlide'>
                    <div className="mainText">
                        <p>
                            КОЛИ ЙДЕТЬСЯ МОВА ПРО СОЛОДКЕ ОПІР ЧИНИТИ МАРНО
                        </p>
                    </div>
                    <img src={require('../../IMG/LandIMG/main_background_3.png')}
                         alt="КОЛИ ЙДЕТЬСЯ МОВА ПРО СОЛОДКЕ ОПІР ЧИНИТИ МАРНО"/>
                </div>
            </Slider>
            <div className='tellLinks'>
                <a href={'tel: +380991800928'}>+380991800928</a>
                <a href={'tel: +380991800928'}>+380991800928</a>
            </div>
            <div className="socialLinksContainer">
                <div className='socialLinks'>
                    <div>
                        <a href={'https://www.instagram.com'}>
                            Instagram
                            <svg width="30" height="30" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M19.9946 9.73807C14.3159 9.73807 9.73288 14.3212 9.73288 20C9.73288 25.6788 14.3159 30.2619 19.9946 30.2619C25.6734 30.2619 30.2564 25.6788 30.2564 20C30.2564 14.3212 25.6734 9.73807 19.9946 9.73807ZM19.9946 26.6695C16.3222 26.6695 13.3252 23.6725 13.3252 20C13.3252 16.3275 16.3222 13.3305 19.9946 13.3305C23.667 13.3305 26.664 16.3275 26.664 20C26.664 23.6725 23.667 26.6695 19.9946 26.6695ZM30.6766 6.92617C29.3508 6.92617 28.2801 7.99689 28.2801 9.32279C28.2801 10.6487 29.3508 11.7194 30.6766 11.7194C32.0025 11.7194 33.0732 10.6537 33.0732 9.32279C33.0736 9.00795 33.0119 8.69612 32.8916 8.40517C32.7713 8.11422 32.5948 7.84986 32.3722 7.62724C32.1495 7.40461 31.8852 7.2281 31.5942 7.10779C31.3033 6.98749 30.9915 6.92577 30.6766 6.92617ZM39.9978 20C39.9978 17.2381 40.0228 14.5013 39.8677 11.7444C39.7126 8.54226 38.9821 5.70034 36.6406 3.35876C34.294 1.01217 31.4572 0.286681 28.2551 0.131576C25.4932 -0.0235287 22.7564 0.00148823 19.9996 0.00148823C17.2378 0.00148823 14.501 -0.0235287 11.7442 0.131576C8.5421 0.286681 5.70023 1.01717 3.35869 3.35876C1.01215 5.70534 0.286675 8.54226 0.131574 11.7444C-0.0235283 14.5063 0.0014882 17.2431 0.0014882 20C0.0014882 22.7569 -0.0235283 25.4987 0.131574 28.2556C0.286675 31.4577 1.01716 34.2997 3.35869 36.6412C5.70524 38.9878 8.5421 39.7133 11.7442 39.8684C14.506 40.0235 17.2428 39.9985 19.9996 39.9985C22.7614 39.9985 25.4982 40.0235 28.2551 39.8684C31.4572 39.7133 34.299 38.9828 36.6406 36.6412C38.9871 34.2947 39.7126 31.4577 39.8677 28.2556C40.0278 25.4987 39.9978 22.7619 39.9978 20ZM35.5949 31.798C35.2296 32.7086 34.7893 33.389 34.0839 34.0895C33.3784 34.795 32.703 35.2353 31.7924 35.6005C29.1606 36.6462 22.9115 36.4111 19.9946 36.4111C17.0777 36.4111 10.8236 36.6462 8.19187 35.6055C7.28127 35.2403 6.60082 34.8 5.90036 34.0945C5.1949 33.389 4.75461 32.7136 4.38937 31.803C3.34869 29.1662 3.58384 22.917 3.58384 20C3.58384 17.083 3.34869 10.8288 4.38937 8.19703C4.75461 7.28641 5.1949 6.60595 5.90036 5.90548C6.60583 5.205 7.28127 4.7597 8.19187 4.39446C10.8236 3.35375 17.0777 3.58891 19.9946 3.58891C22.9115 3.58891 29.1657 3.35375 31.7974 4.39446C32.708 4.7597 33.3884 5.2 34.0889 5.90548C34.7943 6.61095 35.2346 7.28641 35.5999 8.19703C36.6406 10.8288 36.4054 17.083 36.4054 20C36.4054 22.917 36.6406 29.1662 35.5949 31.798Z"
                                    fill="white"/>
                            </svg>
                        </a>
                    </div>
                    <div>
                        <a href={'https://www.facebook.com'}>
                            Facebook
                            <svg width="15" height="30" viewBox="0 0 27 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.89248 50V26.5385H0V18.0913H6.89248V10.8763C6.89248 5.2066 10.9639 0 20.3453 0C24.1437 0 26.9524 0.32775 26.9524 0.32775L26.7311 8.21605C26.7311 8.21605 23.8666 8.19095 20.7408 8.19095C17.3577 8.19095 16.8157 9.5942 16.8157 11.9233V18.0913H27L26.5569 26.5385H16.8157V50H6.89248Z" fill="white"/>
                            </svg>
                        </a>
                    </div>
                    <div>
                        <a href={'https://www.google.com.ua/maps/@48.9291776,24.7002289,14z'}>
                            Google Map
                            <svg width="30" height="30" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M38.0625 12.5C40.1667 17.0209 39.6875 22.3542 37.375 26.6875C35.4167 30.2084 32.6042 33.1875 30.2083 36.4584C29.1667 37.9167 28.125 39.4792 27.3542 41.1667C27.0833 41.7292 26.8958 42.3125 26.6875 42.8959C26.4792 43.4792 26.2917 44.0625 26.1042 44.6459C25.9167 45.1875 25.6875 45.8334 25 45.8334C24.1875 45.8334 23.9583 44.9167 23.7917 44.2917C23.2917 42.7709 22.7917 41.3125 22.0208 39.9167C21.1458 38.2709 20.0417 36.75 18.9167 35.2709L38.0625 12.5ZM19 17.5417L12.125 25.7084C13.3958 28.3959 15.2917 30.6875 17.1042 32.9792C17.5417 33.5 17.9792 34.0417 18.3958 34.6042L27.0833 24.3125L27 24.3334C23.9583 25.375 20.5833 23.8334 19.375 20.8334C19.2083 20.4792 19.0833 20.0625 19 19.6459C18.8854 18.9561 18.8854 18.2522 19 17.5625V17.5417ZM13.7083 9.62502L13.6875 9.64585C10.3125 13.9167 9.72916 19.8542 11.75 24.875L20.0625 15L19.9583 14.8959L13.7083 9.62502ZM29.625 4.91669L22.9167 12.8542L23 12.8334C25.7917 11.875 28.9167 13.0834 30.3333 15.625C30.6458 16.2084 30.8958 16.8334 30.9792 17.4584C31.1042 18.25 31.1458 18.8125 31 19.5834V19.6042L37.6667 11.6875C35.924 8.51958 33.0649 6.11345 29.6458 4.93752L29.625 4.91669ZM20.6042 14.3542L28.75 4.66669L28.6667 4.64585C27.4583 4.33335 26.2292 4.16669 25 4.16669C20.8958 4.16669 17.0208 5.93752 14.2708 8.97919L14.2292 9.00002L20.6042 14.3542Z" fill="white"/>
                            </svg>
                        </a>
                    </div>
                </div>

            </div>
            <div className="itemsContainer">
                {
                    exampleItemData.map( example =>
                    <Link to={'/catalog'} className="item">
                        <img src={require(`../../IMG/${example.image}`)} alt={example.name}/>
                        <h2>{example.name}</h2>
                    </Link>
                    )
                }
            </div>
        </div>
    );
};

export default HomePage;
